blog/using-iptables-to-rate-limit-incoming-connections.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-22 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using iptables to rate-limit incoming connections</title>
<meta name="author" content="Siqing Mu" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using iptables to rate-limit incoming connections</h1>
<p>
The iptables firewall has several useful extension modules which can be used to in addition to the basic firewall functionality. One of the more interesting of these extensions is the "recent" module which allows you to match recent connections, and perform simple throttling on incoming connections.
</p>

<p>
We've previously described keeping SSH access secure by limiting which users can connect, or just firewalling access so that only a small list of trusted IP addresses can connect. In most cases this is sufficient to protect your system.
</p>

<p>
However there are times when you have to allow arbitary incoming connections, when you are travelling for example.
</p>

<p>
In these situations you can open up your system to allow incoming connections and be the target of a dictionary attack - literally a machine trying to connect and login over and over again using usernames and passwords from a dictionary.
</p>

<p>
These attempts will be logged in your /var/log/auth.log file like this:
</p>

<pre class="example" id="orgc8e5886">
sshd[x]: Illegal user admin from aa.bb.cc.dd
sshd[x]: Illegal user test from  aa.bb.cc.dd
sshd[x]: Illegal user guest from aa.bb.cc.dd
</pre>

<p>
In this situation you can create a collection of firewalling rules which will deny access from remote clients who attempt to connect "too many" times.
</p>

<p>
If you have an existing firewall in place, using iptables, then adding the rules is very straightforward.
</p>

<p>
The way the recent module works is fairly straightforward, you basically add IP addresses to a list, which can then be used in the future to test connection attempts against. This allows you to limit the number of connections against either a number of seconds, or connection attempts. In our example we'll do both.
</p>

<p>
An example is probably the simplest way to illustrate how it works. The following two rules will limit incoming connections to port 22 to no more than 3 attemps in a minute - an more than that will be dropped:
</p>

<pre class="example" id="orgd9fbf7a">
iptables -I INPUT -p tcp --dport 22 -i eth0 -m state --state NEW -m recent \
  --set

iptables -I INPUT -p tcp --dport 22 -i eth0 -m state --state NEW -m recent \
  --update --seconds 60 --hitcount 4 -j DROP
</pre>

<p>
The &#x2013;state flag takes a comma seperated list of connection states as an argument, by using "&#x2013;state NEW" as we did we make sure that only new connections are managed by the module.
</p>

<p>
The &#x2013;set parameter in the first line will make sure that the IP address of the host which initiated the connection will be added to the "recent list", where it can be tested and used again in the future i.e. in our second rule.
</p>

<p>
The second rule is where the magic actually happens. The &#x2013;update flag tests whether the IP address is in the list of recent connections, in our case each new connection on port 22 will be in the list because we used the &#x2013;set flag to add it in the preceeding rule.
</p>

<p>
Once that's done the &#x2013;seconds flag is used to make sure that the IP address is only going to match if the last connection was within the timeframe given. The &#x2013;hitcount flag works in a similar way - matching only if the given count of connection attempts is greater than or equal to the number given.
</p>

<p>
Together the second line will DROP an incoming connection if:
</p>
<ul class="org-ul">
<li>The IP address which initiated the connection has previously been added to the list and</li>
<li>The IP address has sent a packet in the past 60 seconds and</li>
<li>The IP address has sent more than 4 packets in total.</li>
</ul>

<p>
You can adjust the numbers yourself to limit connections further, so the following example will drop incoming connections which make more than 2 connection attempts upon port 22 within ten minutes:
</p>
<pre class="example" id="orgb319a57">
iptables -I INPUT -p tcp --dport 22 -i eth0 -m state --state NEW -m recent \
  --set

iptables -I INPUT -p tcp --dport 22 -i eth0 -m state --state NEW -m recent \
  --update --seconds 600 --hitcount 2 -j DROP
</pre>

<p>
If you wish to test these rules you can script a number of connection attempts from an external host with the netcat package.
</p>

<p>
The following script attempts to connect to the IP address 192.168.1.1 5 times. The first couple of attempts you should see a welcome banner such as "SSH-2.0-OpenSSH_3.8.1p1 Debian-8.sarge.4" - after that the script will hang as it's packets are dropped and no response is sent:
</p>

<pre class="example" id="org05ec4c7">
#!/bin/bash

for i in `seq 1 5` ; do
  echo 'exit' | nc 192.168.1.1 22 ;
done
</pre>

<p>
There's a lot of documentation on the netfilter/iptables firewall, and it's available modules which you can find in the Netfilter Extension HOWTO.
</p>

<p>
This HOWTO contains documentation on many different modules, along with examples. A recommended read if you're interested in Linux firewalling.
</p>

<p>
If you wish to experiment with rules and testing it's worth remembering how to remove all active rules. The following commands will flush your iptables filewall, and remove all currently active rules:
</p>
<pre class="example" id="org7429586">
iptables -F
iptables -X
</pre>

<p>
source: <a href="https://debian-administration.org/article/187/Using_iptables_to_rate-limit_incoming_connections">https://debian-administration.org/article/187/Using_iptables_to_rate-limit_incoming_connections</a>
</p>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
